; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v5 ?v2)
             (pred_12 ?v4 ?v6)
             (pred_3 ?v5 ?v6)
             (pred_5 ?v11 ?v5 )
	     (pred_6 ?v5)
             (pred_7 ?v13)
             (pred_1 ?v4)
             (pred_11 ?v6)
             (pred_2 ?v5)
             (pred_10 ?v4)
             (pred_4 ?v5)
             (pred_8 ))



(:action op_2
:parameters (?v12 ?v8 ?v1 ?v7)
:precondition (and (pred_7 ?v12) (pred_7 ?v8) (pred_1 ?v1) (pred_11 ?v7)
          (pred_9 ?v12 ?v8) (pred_12 ?v1 ?v7)
                   (pred_3 ?v8 ?v7) (pred_6 ?v12) 
                   (pred_2 ?v8) (pred_10 ?v1))
:effect (and  (pred_4 ?v8) (not (pred_2 ?v8))))


(:action op_3
:parameters (?v12 ?v3)
:precondition (and (pred_7 ?v12) (pred_7 ?v3)
               (pred_6 ?v12) (pred_9 ?v12 ?v3) (pred_4 ?v3))
:effect (and (pred_6 ?v3) (not (pred_6 ?v12))))

(:action op_4
:parameters (?v12 ?v1)
:precondition (and (pred_7 ?v12) (pred_1 ?v1) 
                  (pred_6 ?v12) (pred_5 ?v1 ?v12) (pred_8 ))
:effect (and (pred_10 ?v1)
   (not (pred_5 ?v1 ?v12)) (not (pred_8 ))))


(:action op_5
:parameters (?v12 ?v10 ?v9)
:precondition (and (pred_7 ?v12) (pred_1 ?v10) (pred_1 ?v9)
                  (pred_6 ?v12) (pred_10 ?v9) (pred_5 ?v10 ?v12))
:effect (and (pred_10 ?v10) (pred_5 ?v9 ?v12)
        (not (pred_10 ?v9)) (not (pred_5 ?v10 ?v12))))

(:action op_1
:parameters (?v12 ?v1)
:precondition (and (pred_7 ?v12) (pred_1 ?v1) 
                  (pred_6 ?v12) (pred_10 ?v1))
:effect (and (pred_8 ) (pred_5 ?v1 ?v12) (not (pred_10 ?v1)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_12 obj_16 obj_15 obj_20 obj_06 obj_13 obj_02 obj_01 obj_17 obj_07 obj_11 obj_05 obj_04 obj_03 obj_14 obj_09
    obj_08 obj_10
    obj_19 obj_18
    )

    (:init
       (pred_8)

       (pred_7 obj_12)
       (pred_7 obj_16)
       (pred_7 obj_15)
       (pred_7 obj_20)
       (pred_7 obj_06)
       (pred_7 obj_13)
       (pred_7 obj_02)
       (pred_7 obj_01)
       (pred_7 obj_17)
       (pred_7 obj_07)
       (pred_7 obj_11)
       (pred_7 obj_05)
       (pred_7 obj_04)
       (pred_7 obj_03)
       (pred_7 obj_14)
       (pred_7 obj_09)
       (pred_11 obj_08)
       (pred_11 obj_10)
       (pred_1 obj_19)
       (pred_1 obj_18)

       (pred_9 obj_12 obj_06)
       (pred_9 obj_12 obj_16)
       (pred_9 obj_16 obj_13)
       (pred_9 obj_16 obj_15)
       (pred_9 obj_16 obj_12)
       (pred_9 obj_15 obj_02)
       (pred_9 obj_15 obj_20)
       (pred_9 obj_15 obj_16)
       (pred_9 obj_20 obj_01)
       (pred_9 obj_20 obj_15)
       (pred_9 obj_06 obj_17)
       (pred_9 obj_06 obj_13)
       (pred_9 obj_06 obj_12)
       (pred_9 obj_13 obj_07)
       (pred_9 obj_13 obj_02)
       (pred_9 obj_13 obj_16)
       (pred_9 obj_13 obj_06)
       (pred_9 obj_02 obj_11)
       (pred_9 obj_02 obj_01)
       (pred_9 obj_02 obj_15)
       (pred_9 obj_02 obj_13)
       (pred_9 obj_01 obj_05)
       (pred_9 obj_01 obj_20)
       (pred_9 obj_01 obj_02)
       (pred_9 obj_17 obj_04)
       (pred_9 obj_17 obj_07)
       (pred_9 obj_17 obj_06)
       (pred_9 obj_07 obj_03)
       (pred_9 obj_07 obj_11)
       (pred_9 obj_07 obj_13)
       (pred_9 obj_07 obj_17)
       (pred_9 obj_11 obj_14)
       (pred_9 obj_11 obj_05)
       (pred_9 obj_11 obj_02)
       (pred_9 obj_11 obj_07)
       (pred_9 obj_05 obj_09)
       (pred_9 obj_05 obj_01)
       (pred_9 obj_05 obj_11)
       (pred_9 obj_04 obj_03)
       (pred_9 obj_04 obj_17)
       (pred_9 obj_03 obj_14)
       (pred_9 obj_03 obj_07)
       (pred_9 obj_03 obj_04)
       (pred_9 obj_14 obj_09)
       (pred_9 obj_14 obj_11)
       (pred_9 obj_14 obj_03)
       (pred_9 obj_09 obj_05)
       (pred_9 obj_09 obj_14)
       (pred_2 obj_17)
       (pred_2 obj_13)
       (pred_3  obj_17 obj_08)
       (pred_3  obj_13 obj_10)
       (pred_4 obj_12)
       (pred_4 obj_16)
       (pred_4 obj_15)
       (pred_4 obj_20)
       (pred_4 obj_06)
       (pred_4 obj_02)
       (pred_4 obj_01)
       (pred_4 obj_07)
       (pred_4 obj_11)
       (pred_4 obj_05)
       (pred_4 obj_04)
       (pred_4 obj_03)
       (pred_4 obj_14)
       (pred_4 obj_09)

       (pred_12  obj_19 obj_08)
       (pred_12  obj_18 obj_10)
       (pred_5 obj_19 obj_11)
       (pred_5 obj_18 obj_04)
       (pred_6 obj_03)
    )

    (:goal (and
       (pred_5 obj_19 obj_09)
    ))
(:constraints
  (always (not (pred_6 obj_14)))
)
)

; plan
1. (op_3 obj_03 obj_07)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_07)
   goals met: 0 of 1
2. (op_3 obj_07 obj_11)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_11)
   goals met: 0 of 1
3. (op_4 obj_11 obj_19)
   deleted: (pred_5 obj_19 obj_11) (pred_8)
   added: (pred_10 obj_19)
   goals met: 0 of 1
4. (op_3 obj_11 obj_05)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_05)
   goals met: 0 of 1
5. (op_3 obj_05 obj_09)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_09)
   goals met: 0 of 1
6. (op_1 obj_09 obj_19)
   deleted: (pred_10 obj_19)
   added: (pred_8) (pred_5 obj_19 obj_09)
   goals met: 1 of 1
